[
	{
		"id": 71,
		"slug": "ibm",
		"position": "UI Architect / Sr. Front-End Developer Lead / Strategist",
		"start_date": "20140801",
		"still_employed": "1",
		"end_date": "",
		"location": "Fort Worth, TX (Home-based / Remote)",
		"additional": "",
		"title": { "rendered": "IBM" },
		"content": {
			"rendered":
				"<p>(Acquired Lighthouse Security Group in August 2014)<br />\nArchitects the user experience, design, development, documentation and best practices for all Cloud Identity projects. Created code guidelines and version control processes for all front-end development within our team. Developed a JavaScript framework and process used for all front-end development. Provides design and art-direction for all wireframes, interactive layouts, interface mockups, graphics, icons, color schemes and prototypes for product releases and updates.</p>\n<p>Maintains a working knowledge of current and evolving technology and design processes to keep pace with innovation possibilities. Mentors and leads FED/UI/UX staff in all aspects of front-end design and development, including wireframe development and reviews, code reviews and deployment processes.</p>\n"
		}
	},
	{
		"id": 70,
		"slug": "davegillem-com",
		"position": "Freelance Designer / Art Director / Front-End Developer",
		"start_date": "19980901",
		"still_employed": "1",
		"end_date": "",
		"location": "Dallas / Fort Worth Area",
		"additional": "",
		"title": { "rendered": "DaveGillem.com" },
		"content": {
			"rendered":
				"<p>Designs and develops interactive web experiences for a diverse client base. Provides all front-end design and development for the project including HTML, JavaScript, CSS, PhotoShop, Illustrator, and Sketch. Developed content management systems for rich-media websites, as well as WordPress theme development and maintenance. Creates advertising material such as business cards, stickers, logo design, and motion graphics.</p>\n"
		}
	},
	{
		"id": 69,
		"slug": "lighthouse-computer-services",
		"position": "Interactive Art Director / Front-End Developer / Designer / Strategist",
		"start_date": "20120101",
		"still_employed": "0",
		"end_date": "20140801",
		"location": "Fort Worth, TX (Home-based / Remote)",
		"additional": "",
		"title": { "rendered": "Lighthouse Computer Services" },
		"content": {
			"rendered":
				"<p>Architects the user experience, design, development, documentation and best practices for all Cloud Identity projects. Created code guidelines and version control processes for all front-end development within our team. Developed a JavaScript framework and process used for all front-end development. Provides design and art-direction for all wireframes, interactive layouts, interface mockups, graphics, icons, color schemes and prototypes for product releases and updates.</p>\n<p>Acquired by IBM in August 2014.</p>\n"
		}
	},
	{
		"id": 68,
		"slug": "sabre-airline-solutions",
		"position": "Principal Art Director / Solutions Manager",
		"start_date": "20110301",
		"still_employed": "0",
		"end_date": "20120101",
		"location": "Southlake, Tx.",
		"additional": "",
		"title": { "rendered": "Sabre Airline Solutions" },
		"content": {
			"rendered":
				"<p>Created strategy and delivery process for new or existing products. End to end accountability for the product, from inception to deployment to performance, including user experience, functionality, determination of performance and profitability. Subject matter expert on a consulting basis on multiple projects. Managed delivery and resource capacity as well as projects involving cross-functional teams. Provided guidance and art direction in designing and developing functionality that matches current system features and interface standards. </p>\n"
		}
	},
	{
		"id": 67,
		"slug": "travelocity",
		"position": "Interactive Creative Director / Frontend Developer",
		"start_date": "20040301",
		"still_employed": "0",
		"end_date": "20110301",
		"location": "Southlake, Tx",
		"additional": "",
		"title": { "rendered": "Travelocity" },
		"content": {
			"rendered":
				"<p>Designed and directed staff in the development of interactive layouts and content, user interface graphics, icons, color schemes, content, and supporting infrastructure for new product releases and offerings. Defined project requirements, competitive analysis, business plans, product lifecycle management and prototype development. Provided creative direction and development coaching to staff members. Ensured appealing and consistent user interface practices were followed that fulfilled the corporate brand requirements. Regularly engaged with management, business owners, field representatives, brand marketing, and site experience colleagues in order to maximize the effectiveness of the projects. Conducted web usability testing and created the materials for testing as required.</p>\n"
		}
	},
	{
		"id": 66,
		"slug": "sabre",
		"position": "Senior Web Designer / Developer",
		"start_date": "20000601",
		"still_employed": "0",
		"end_date": "20040301",
		"location": "Southlake, Tx",
		"additional": "",
		"title": { "rendered": "Sabre" },
		"content": {
			"rendered":
				"<p>Developed and maintained web-based solutions for the corporate websites, partner websites and intranet-based applications with the use of HTML, Flash, JavaScript, CSS. Created interface designs and concepts using Photoshop and Illustrator, product overviews, games and animated web content with the use of Flash, Adobe Premiere and After Effects. Redesigned partner websites, including a new interface, navigation, and all front-end coding. Created multiple Flash-Based web applications and marketing websites. Aided in the Flash-based Rich Internet Application strategy and development, including prototyping, technology research, testing, and vendor coordination.</p>\n"
		}
	},
	{
		"id": 65,
		"slug": "the-art-institute-of-dallas",
		"position": "Student Teacher / Aid",
		"start_date": "19990101",
		"still_employed": "0",
		"end_date": "20000901",
		"location": "Dallas, Tx.",
		"additional": "",
		"title": { "rendered": "The Art Institute of Dallas" },
		"content": {
			"rendered":
				"<p>Assist college instructors with the teaching of software programs such as Adobe Photoshop, Illustrator, After Effects, and Premiere. Aid students with project preparation and development. Provide students with creative direction and influence.</p>\n"
		}
	},
	{
		"id": 64,
		"slug": "imaginuity-interactive",
		"position": "Designer / Technical Trainer",
		"start_date": "19990901",
		"still_employed": "0",
		"end_date": "20000601",
		"location": "Dallas, Tx",
		"additional": "",
		"title": { "rendered": "Imaginuity Interactive" },
		"content": {
			"rendered":
				"<p>Provided high school (Lincoln High School, Dallas Texas) students with a hands-on education in graphic design, multimedia design, and web page design. Mentored students in the areas of Adobe PhotoShop, Illustrator, HTML, and web/print design fundamentals. Created all design material including graphical content, website, and recruiting information. Developed a comprehensive technical curriculum, for use in the after-school program, Whiz Kidz. As part of the design department, I provided design and marketing development for web, print and interactive presentations.</p>\n"
		}
	}
]
