[{
	"id": 175,
	"slug": "contact",
	"title": {
		"rendered": "Contact"
	},
	"content": {
		"rendered": "<div>\n<div>Please don&#8217;t contact me to sell or &#8216;help me&#8217; with anything. I don&#8217;t need your company to do my work, design my logos, be my &#8216;partner,&#8217; or be my &#8216;support team&#8217;. I also don&#8217;t have the need to hire anyone for my freelance projects nor am I the person to contact for hiring at IBM.<\/div>\n<div>Thank you!<\/div>\n<\/div>\n"
	}
}, {
	"id": 14,
	"slug": "resume",
	"title": {
		"rendered": "Overview"
	},
	"content": {
		"rendered": "<p>I am a Front-end Developer, Art Director, Interactive Designer\/Developer, and Digital Artist. I am a &#8216;UI-Guy&#8217; by choice, it&#8217;s what I like, it&#8217;s what I do. I am well versed in any aspect of the user experience whether that be from a design, development, strategy, direction, management or marketing perspective. I pride myself on being able to see the big picture without losing the details and feel there is a place for both pragmatic and creative thinking with every project. I enjoy solving problems no matter what their nature. I am a natural teacher, an excellent communicator, and a proven leadership track record. Experienced in working across multiple disciplines and roles.<\/p>\n<div id=\"proficientSkills\">\n<p>Highly proficient in:<\/p>\n<ul>\n<li>JavaScript<\/li>\n<li>Vue (a version of this site was built with Vuejs)<\/li>\n<li>React (a version of this site was built with React)<\/li>\n<li>CSS\/LESS\/SASS<\/li>\n<li>HTML<\/li>\n<li>jQuery<\/li>\n<li>Handlebars<\/li>\n<li>Git<\/li>\n<li>Bootstrap<\/li>\n<li>Photoshop<\/li>\n<li>Sketch<\/li>\n<li>WordPress<\/li>\n<li>working with REST API&#8217;s<\/li>\n<\/ul>\n<\/div>\n<div id=\"learningSkills\">\n<p>Gaining experience with:<\/p>\n<ul>\n<li>GraphQL<\/li>\n<li>NodeJS<\/li>\n<\/ul>\n<\/div>\n"
	}
}, {
	"id": 9,
	"slug": "about",
	"title": {
		"rendered": "About Me"
	},
	"content": {
		"rendered": "<div>I am an Art Director, Interactive Designer\/Developer, Front-end Developer and Digital Artist. I am a &#8216;UI-Guy&#8217; by choice, it&#8217;s what I like, it&#8217;s what I do. I am well versed in any aspect of the user experience whether that be from a design, development, strategy, direction, management or marketing perspective. I pride myself on being able to see the big picture without losing the details and feel there is a place for both pragmatic and creative thinking with every project. I enjoy solving problems no matter what their nature. I am a natural teacher, an excellent communicator, and a proven leadership track record. Experienced in working across multiple disciplines and roles. I&#8217;m a knowledge junkie who never tires of learning something new.<\/div>\n<div>That&#8217;s enough of the elevator pitch. This site is the “un-design” of my portfolio to offer links to my work\/code\/designs and provide a bit of background and insight into my experience. Rather than drabble on about myself or my work I’ll just hit on a few points in the Q&amp;A below. <\/div>\n<h2>So what&#8217;s up with the site ‘design’?<\/h2>\n<div>The design (or lack thereof) is really just so that I could have a simple way to display some of my work without getting so hung up on the ‘wrapping paper’. And let&#8217;s be honest, designers are their own worst client and I’m no exception. I HATE doing work for myself because I can get hung up on trying to make it “too cool” or using all of the latest technology when really all that’s required is an easy way to view the work. That&#8217;s why most designer portfolios get a redesign once a decade… because we suck as clients. Therefore I chose to remove the ‘must be the coolest design ever imagined’ requirement from the project scope.<\/div>\n<h2>Is this really all the work you could come up with after 20+ years?<\/h2>\n<div>Uhh&#8230; no. I don&#8217;t freelance much (at all) anymore but when I did, a lot of the work was under NDA\/non-advertise\/non-compete agreements so some of those projects aren&#8217;t displayed. Other freelance work either isn&#8217;t a current representation of my abilities, no longer online or its just old. I do have a 9-5 (or more accurately a 7-6) job and do a lot of design and development every day. Not everything I do daily is ‘portfolio material’. <\/div>\n<h2>Aren’t you just a ‘Flash’ guy, what&#8217;s with the HTML site?<\/h2>\n<div>Granted, a lot of the freelance work I have done in the past has been Flash-based, but let me be clear. Much like a mechanic isn&#8217;t defined by the wrench in his toolbox, I am not defined by the tools I use. I think Flash was a great platform that allowed me to express an idea without compromise and deliver a more immersive experience than HTML could ever hope to do. That being said I was coding HTML\/CSS\/JS by hand long before – and during the time – I started working with Flash. Flash was just a tool like jQuery\/Vuejs\/React\/TypeScript\/Photoshop\/Etc.. are all just tools. I won&#8217;t go into my disappointment with where the Flash platform has gone here. I will say that technologies will come and go and if you are stuck being defined by any one of them you are doing yourself a great disservice. <\/div>\n<h2>Did you write every single line of code for this site?<\/h2>\n<div>No, absolutely not. I’m a fan of not reinventing the wheel and not too proud to say if a solid code library\/framework has already been created to do something I want to do, I use it. Why anyone gets hung up on the need to write everything from scratch is beyond me. That being said, this awesome template of supreme eye candy you see before you (sarcasm) is created with React\/Vuejs (separate implementations) for the front end (with a little Bulma css sprinkled in as a base) and the WordPress REST API to provide the data. It&#8217;s not a template, theme or website builder. Why so bland you ask? Well, removing the &#8220;has to be the coolest design ever&#8221; requirement provides me a way to get rid of my absolute worst client&#8230; myself. As I&#8217;ve already mentioned, I hate doing work for myself, I&#8217;m my own worst critic. I&#8217;m also the worst person to communicate requirements to myself, its a perpetual argument with no winner.<\/div>\n<h2>Wait a minute, are you a designer or a developer?<\/h2>\n<div>Do I have to be either or? I realize that nowadays people are choosing to become\/becoming more ‘specialized’ as an information architect, a Photoshop artist, an HTML\/CSS coder, or a Javascript developer, etc.. When I started in this industry you were either a front-end or back-end guy. I have always worked hard to make sure I stayed capable of being able to deliver the entire UI. Whether it’s brainstorming, to a concept, to mock-up, to art direction, and finally to production ready code that has to be maintained. I’m very comfortable with every aspect of the UI. If it&#8217;s on this side of the server, that&#8217;s my gig. I think its important for the designer to be able to understand information delivery and usability when they are creating a mock-up. It’s equally important to understand if\/how something can be coded while they are in Photoshop\/Sketch. And when the picture has to become reality it’s inevitable that pixels will change when converted to a coded page\/widget\/application and therefore the UI developer\/coder needs to understand what pixels can be altered without losing the integrity of the design.<\/div>\n<div>It’s also a nice balance for me. I can float back and forth between Photoshop\/Sketch and code which allows me to not get too burnt out on either. That&#8217;s just the way I was taught and that&#8217;s how I continue to progress in my career.<\/div>\n<h2>So this all tells me nothing, who are you?<\/h2>\n<div>I’m just a guy with a lot of tattoos that likes crayons a little too much. A father of two awesome kids, husband to a wife that lets me think I’m cool, a devoted Boston Celtic fan, former basketball coach, horrible guitar player, wannabe mechanic, and an all-around nice guy (subject to change\/debate\/opinion). If you need more professional info feel free to <a href=\"https:\/\/www.linkedin.com\/in\/davegillem\/\" target=\"_blank\" rel=\"noopener\">check out my LinkedIn profile<\/a>.<\/div>\n<h2>Hey, you sound like a cool guy, wanna be Facebook friends?<\/h2>\n<div>Thanks but no thanks. Nothing personal, I just try and keep my personal life and professional life as separate as possible.<\/div>\n<div>Need even more info? Really?? Ok, well feel free to <a href=\"#\/contact\">shoot me an email<\/a>.<\/div>\n"
	}
}, {
	"id": 6,
	"slug": "home",
	"title": {
		"rendered": "TL;DR"
	},
	"content": {
		"rendered": "<div>This is my online business card and experimental portfolio site I built as an attempt to get more familiar with <a href=\"https:\/\/davegillem.com\" title=\"View the React version\" rel=\"noopener\">React<\/a> and <a href=\"https:\/\/davegillem.com\/vuejs\/\" title=\"View the VueJS version\" rel=\"noopener\">Vuejs<\/a> (seprate front-ends). I&#8217;m using WordPress as the back-end CMS and the REST API to deliver the data to the front-end. Its seriously nothing fancy or meant to blow anyone away with my awesome design talent, its literally just a place to provide anyone interested a way to view some of my work, learn a bit about who I am, and give a way to <a href=\"#\/contact\">contact me<\/a> if needed.<\/div>\n<div>Below links to items that would otherwise be displayed in a portfolio, resume\/CV, or personal pitch package. Aside from being my own worst client, I don&#8217;t have an ego that compels me to reinvent the wheel in an attempt to display my resume here better than <a href=\"https:\/\/www.linkedin.com\/in\/davegillem\/\" target=\"_blank\" rel=\"noopener\">LinkedIn<\/a> does;  display code better than <a href=\"https:\/\/github.com\/davegillem\" target=\"_blank\" rel=\"noopener\">Github<\/a> || <a href=\"https:\/\/codepen.io\/davegillem\/\" target=\"_blank\" rel=\"noopener\">Codepen<\/a>; UI &amp;&amp; Artwork better than <a href=\"https:\/\/www.behance.net\/davegillem\" target=\"_blank\" rel=\"noopener\">Behance<\/a> || <a href=\"https:\/\/dribbble.com\/davegillem\" target=\"_blank\" rel=\"noopener\">Dribbble<\/a>; my senseless ramblings better than Facebook || <a href=\"https:\/\/twitter.com\/davegillem\" target=\"_blank\" rel=\"noopener\">Twitter<\/a> || <a href=\"https:\/\/www.instagram.com\/davegillem\/\" target=\"_blank\" rel=\"noopener\">Instagram<\/a>; or my certifications and assessments better than <a href=\"https:\/\/app.pluralsight.com\/profile\/dave-gillem\" target=\"_blank\" rel=\"noopener\">PluralSight<\/a> || <a href=\"https:\/\/www.codeschool.com\/users\/davegillem\" target=\"_blank\" rel=\"noopener\">CodeSchool<\/a>. So depending on what you’re after here, the links provided should give you what you need.<\/div>\n<div>If you require more information than what these services provide you can feel free to use one of them to reach out to me and ask for more. Trying to sell me something, don&#8217;t bother. Got a project you want me to work on? Understand that I don&#8217;t do much (if any) freelance anymore as I prefer the family time and personal projects over the monetary reward that side projects offer. Having said that, if you feel your project would compel me to believe otherwise then <a href=\"#\/contact\">feel free to reach out<\/a>. Thanks for stopping by, check out the links below for more information.<\/div>\n"
	}
}]