[{"id":155,"slug":"stephen-miessner","date_provided":"03162018","job_title":"Usability Engineer at IBM","title":{"rendered":"Stephen Miessner"},"content":{"rendered":"<p>Brilliant! That&#8217;s my word for Dave Gillem. I&#8217;ve known Dave professionally for 15 years and have had the pleasure of working with him part of that time. He always has a solution. Whether the challenge is user experience, art direction, coding, or site architecture; Dave Gillem is the powerhouse solution. People often talk about team-players but he goes above and beyond. Dave inspires his peers to trust their judgement.<\/p>\n"}},{"id":149,"slug":"nastasha-wells","date_provided":"02272018","job_title":"Vice President, UX Creative Director at Citi","title":{"rendered":"Nastasha Wells"},"content":{"rendered":"<p>I had the pleasure of working with Dave at Travelocity for many years. Dave was a true testament to the creative unicorn! He is a rare find due to his ability to see the full picture, determine the business problem, provide a forward thinking solution, design it, code it, art direct it, and still manages time to grow a team!!<\/p>\n<p>He demands high quality of work and work ethic, and it would be a pleasure to work with Dave Gillem again!<\/p>\n"}},{"id":119,"slug":"chris-lauer","date_provided":"02062018","job_title":"Lead Product Designer – Contract at Bridgevine, Inc.","title":{"rendered":"Chris Lauer"},"content":{"rendered":"<p>I worked with Dave for several years at Travelocity where I learned just how rare his talents are. Dave is the elusive unicorn with an unusual blend of outstanding creative visual design and incredibly tight and reusable front-end code. He is professional who has always exceeded expectations with his brilliant and creative work. Dave has the ability to be the ultimate team player or put the team on his shoulders whenever the situation calls. Dave is a pleasure to work with and would be the first person I would call if an opportunity was available.<\/p>\n"}},{"id":118,"slug":"russell-goldstein","date_provided":"02062018","job_title":"Advisory Software Engineer at IBM Security","title":{"rendered":"Russell Goldstein"},"content":{"rendered":"<p>I&#8217;ve worked with Dave for about 6 years and can honestly say he&#8217;s one of the brightest developers I&#8217;ve ever worked with. When he first came onboard, he rewrote the UI of our application and because of Dave&#8217;s forward thinking, business changes that affected the UI over the years have been simple to implement. I&#8217;ve worked closely on a day by day basis with Dave, writing backend APIs that he will consume for the UI. Working collaboratively in this manner has been so easy &#8211; Dave always wants to do what&#8217;s best for the product and has a &#8220;get it done&#8221; attitude. He has also taught me how to get inside an end user&#8217;s mind and understand what they are thinking, and how that translates to a user experience with the application. It&#8217;s been an absolute pleasure working with Dave, and I know our product has succeeded in large part due to his efforts over the years.<\/p>\n"}},{"id":117,"slug":"brian-sullivan","date_provided":"02052018","job_title":"Director, Design Strategy at Sabre Corporation","title":{"rendered":"Brian Sullivan"},"content":{"rendered":"<p>Dave Gillem is one of the most passionate designers that I have ever seen. He loves to build usable designs build in observing users, working with technology, and understanding the business. He just knows how to get things done. Plus, his designs are creative, beautiful, intuitive, and user-friendly. Dave has a can-do attitude in all that he does.<\/p>\n"}},{"id":116,"slug":"patty-poling","date_provided":"07072016","job_title":"Director of Communications Graphic Design Freelancer","title":{"rendered":"Patty Poling"},"content":{"rendered":"<p>Dave is a pleasure to work with. He comprehends the need quickly which prevents inefficiency and turns the project around quickly. Dave&#8217;s work is high quality and he reflects it through his ability to orchestrate all the elements necessary while keeping it visually stunning. The best part is he thinks of and includes the details you may have overlooked. You can&#8217;t go wrong with Dave, I highly recommend him!<\/p>\n"}},{"id":115,"slug":"anthony-moran","date_provided":"09152014","job_title":"Security Architect at IBM","title":{"rendered":"Anthony Moran"},"content":{"rendered":"<p>I hired Dave as our IAD at the beginning of 2012 and since that time he has continually impressed me as he helped reshape our whole product line. Dave has a great knack of breaking down the business requirements and shaping them into a killer user experience. He also has a great ability to remain calm and help steer the team during times of stress. I highly recommend Dave and think he would be an excellent addition to any team.<\/p>\n"}},{"id":114,"slug":"jim-smith","date_provided":"10032012","job_title":"Owner, Laser Imaging & Design, Inc.","title":{"rendered":"Jim Smith"},"content":{"rendered":"<p>Dave was the most professional web designer we have ever worked with. Incredibly detailed and always exceeding our expectations. We would have more work for him if he was not always so backed up with projects&#8230;&#8230;his work is very much in demand!<\/p>\n"}},{"id":113,"slug":"john-c-elieson","date_provided":"10032012","job_title":"President and CEO at Radixx International","title":{"rendered":"John C. Elieson"},"content":{"rendered":"<p>Dave is very creative but goes far beyond most artists in his business acumen and applicability. Dave is a high integrity, hard-working talented designer. He brought business insights and ideas to every creative challenge and was an effective manager of the design staff. I highly recommend Dave for any design, managerial or business innovation position.<\/p>\n"}},{"id":112,"slug":"anette-henningson","date_provided":"08142011","job_title":"Design Studio","title":{"rendered":"Anette Henningson"},"content":{"rendered":"<p>Working with Dave at Travelocity he was always an inspiration to the design team to be looking out for the next thing and keeping current on software and skills.<\/p>\n<p>He&#8217;s a guy that will think before he acts and this I believe cut out a lot of churn for his team, at the same time, when he does move, he does so with conviction and passion.<\/p>\n"}},{"id":111,"slug":"esther-kibby","date_provided":"07232011","job_title":"Principle at Esther Kibby Creative","title":{"rendered":"Esther Kibby"},"content":{"rendered":"<p>Dave Gillem is a talented, creative designer with a strong believe in the integration of innovation and usability in the web industry. He is also provides professional advice and encouragement to aspiring designers in this quickly changing field.<\/p>\n"}},{"id":110,"slug":"sederrick-raphiel","date_provided":"06052008","job_title":"Creative Director at The Design Factory","title":{"rendered":"Sederrick Raphiel"},"content":{"rendered":"<p>Dave is without doubt one of the most talented Designer\/Developer I&#8217;ve every worked with. It&#8217;s rare to find Developer who knows how to design or visa versa but Dave has mastered both sides. I would recommend him without hesitation.<\/p>\n"}},{"id":109,"slug":"laterras-r-whitfield","date_provided":"03122008","job_title":"Blazin' Clothing Brand; Solja Entertainment, LLC and Motivational Speaker","title":{"rendered":"Laterras R. Whitfield"},"content":{"rendered":"<p>If you are looking for a stellar website in a prompt timeframe, Dave Gillem is your man. I&#8217;ve used him repeatedly and have nothing but glowing reviews to give.<\/p>\n"}},{"id":108,"slug":"adam-polansky","date_provided":"01142008","job_title":"Lead XD Strategist at Bottle Rocket Studios","title":{"rendered":"Adam Polansky"},"content":{"rendered":"<p>I worked with Dave on the development of Travelocity&#8217;s first experience-based property, a rich internet application called ExperienceFinder. Dave&#8217;s ability to realize ideas into a usable design was at the backbone of an effort which, as it continues to mature, will completely change people&#8217;s expectation of what a travel web-site should be. <\/p>\n<p>Even though he was focused on the visual design and Flash development of the product, he is an outstanding &#8220;critical thinker. I came to rely on his innate understanding of the need for good function to inform my efforts within the information architecture.<\/p>\n"}},{"id":107,"slug":"shari-manning","date_provided":"10292007","job_title":"Sabre Holdings","title":{"rendered":"Shari Manning"},"content":{"rendered":"<p>Dave is THE most talented designer I know. To find this level of creativity and passion coupled with his incredible Web expertise is extremely rare. But, that&#8217;s just the beginning. He is also a fantastic manager and an energetic teacher\/mentor. He is a strategic thinker and a world-class team leader. There is no project that he cannot handle, regardless of the challenges. With his amazing level of detail every nuance is considered, then executed perfectly. He is able to seamlessly blend marketing and functionality into a Web site that both fits his clients&#8217; needs\/vision, and is an art form in itself. His humor and ability to engage others makes collaboration just plain fun. Dave has definitely achieved legendary status. In my opinion, everything Dave touches seems nothing less than magical.<\/p>\n"}},{"id":106,"slug":"joshua-corliss","date_provided":"10222007","job_title":"Design Director of Digital \/ Motion","title":{"rendered":"Joshua Corliss"},"content":{"rendered":"<p>Dave is hands down one of the most talented developer\/programmer I&#8217;ve ever had the pleasure to work with, and around.<\/p>\n<p>He&#8217;s truly selfless, as he donates his free time, code and knowledge to bettering the Web Design community at a forum we manage together.<\/p>\n<p>Not only is his code expertly hand crafted and precise, it&#8217;s easy to comprehend for those with little or no knowledge.<\/p>\n<p>I heard he was raised by wolves!<\/p>\n"}},{"id":105,"slug":"pranav-shah","date_provided":"10222007","job_title":"Manager - Application Development at Cablevision","title":{"rendered":"Pranav Shah"},"content":{"rendered":"<p>While working in Home Page Personalization project at Travelocity I got chance to work with Dave. He is very smart and talented. He is very good at Web designing specially Flash . He is great asset to any company.I highly recommend him.<\/p>\n"}},{"id":104,"slug":"thy-huynh","date_provided":"10162007","job_title":"Business Analyst at Southwest Airlines","title":{"rendered":"Thy Huynh"},"content":{"rendered":"<p>Dave is passionate about his work. He is a great team leader and inspires the people around him with his creativity and problem solving skills.<\/p>\n"}},{"id":103,"slug":"yvette-hunt","date_provided":"10162007","job_title":"Creative Director at First Baptist Church of Keller","title":{"rendered":"Yvette Hunt"},"content":{"rendered":"<p>Dave is an extremely smart designer who not only considers the aesthetics of a site but also considers usability to be of utmost importance. He is one of the few designers that I consider to be as talented in the graphic and design world as he is in the programming and functionality areas of Web design.<\/p>\n<p>While I worked with Dave, he took our external site to a whole new level, upgrading the graphic look and feel as well as the organizational layout of the site. His award-winning work laid the foundation on which we still build today.<\/p>\n<p>Dave is a joy to work with. He brings intelligence, humor and a passion for great design to the table every day. He is dedicated to those with whom he works and is eager to share his knowledge as well as learn new skills and techniques. He is tireless in his search for excellence.<\/p>\n"}},{"id":102,"slug":"jenny-massey","date_provided":"10082007","job_title":"Director, Solution Delivery at Sabre Corporation","title":{"rendered":"Jenny Massey"},"content":{"rendered":"<p>Dave maintains a strategic focus on his deliverables. He continually thinks outside of the box to identify opportunities that will enhance and streamline feature functionality, leverage synergies across groups to decrease duplication of efforts and maximize revenues. He is extremely thoughtful and detail oriented in his design recommendations, and is successful at influencing others to follow his direction. Dave is an innovator and a leader, and respected and admired by his peers.<\/p>\n"}},{"id":101,"slug":"guy-dilger","date_provided":"10082007","job_title":"Vice President of Marketing at Plain Green, LLC","title":{"rendered":"Guy Dilger"},"content":{"rendered":"<p>David is a skilled web developer. Always had great ideas and found technical solutions for the problems we gave him. Self-motivated, mature, and highly creative.<\/p>\n"}},{"id":100,"slug":"rachel-gay","date_provided":"10082007","job_title":"PMP, CSM Experienced Program Management Leader","title":{"rendered":"Rachel Gay"},"content":{"rendered":"<p>I have worked with Dave for over a year at Travelocity. Dave&#8217;s creative work is innovative, while retaining simplicity and usability. Besides his creative talents, Dave is able to gain concensus and lead his team toward a common goal. Demonstrates project management skills as task identification and estimation, communication and collaboration. Clearly states his ideas and opinions while showing respect for others.<\/p>\n"}},{"id":99,"slug":"taylor-cowan","date_provided":"10062007","job_title":"Cloud Solutions Architect at Microsoft","title":{"rendered":"Taylor Cowan"},"content":{"rendered":"<p>David is that rare individual who can combine the artistic skills of visual design with good software engineering technique. I also admire his patience and commitment to seeing difficult projects through to successful completion. I’ve witnessed Mr. Gillem’s vision take shape in the form of several innovative user interfaces, and a maturing team of designers who he mentors.<\/p>\n"}},{"id":98,"slug":"danny-handler","date_provided":"10062007","job_title":"Owner, The Design Core","title":{"rendered":"Danny Handler"},"content":{"rendered":"<p>Dave possesses all of the characteristics that anyone could hope find when looking for a web designer.<\/p>\n<p>His broad scope of knowledge in all aspects of web design\/development and his professionalism make him a one of a kind.<\/p>\n<p>It is always a pleasure working with Dave.<\/p>\n"}},{"id":97,"slug":"tom-schrader","date_provided":"10052007","job_title":"Concept Designer at Sabre Corporation","title":{"rendered":"Tom Schrader"},"content":{"rendered":"<p>Dave is an extremely talented and dedicated interactive designer. His work is visually impressive and he is a master at Adobe Flash, Flex and actionscript. Dave successfully leads and motivates an experience design team in delivering innovative products for Travelocity.<\/p>\n"}},{"id":96,"slug":"stephani-hawkins","date_provided":"10052007","job_title":"Editor at Sabre Airline Solutions","title":{"rendered":"Stephani Hawkins"},"content":{"rendered":"<p>Dave is by far one of the most talented, creative Web designers I know. He&#8217;s always delivered more than promised, and he has a professional yet friendly disposition. I&#8217;ve worked with Dave for about six years, and I look forward to working with him on many more projects in the future.<\/p>\n"}},{"id":95,"slug":"todd-milburn","date_provided":"10052007","job_title":"Sr. Software Engineer at Southwest Airlines","title":{"rendered":"Todd Milburn"},"content":{"rendered":"<p>Dave is a rock star. His Flash skills are legendary at Travelocity. <\/p>\n<p>His passion for quality was exampled by his wholistic approach to software development and design, using cutting-edge methodologies. <\/p>\n<p>His leadership abilities were demonstrated daily by being the go-to guy for solutions, and by leading training sessions to advance the skills of his entire team. <\/p>\n<p>I&#8217;d love to work with Dave again in the future.<\/p>\n"}},{"id":94,"slug":"miriam-ynocencio","date_provided":"10052007","job_title":"Director of Design Technologies; Design Thinking Program Lead Specializing in Design Transformation","title":{"rendered":"Miriam Ynocencio"},"content":{"rendered":"<p>Dave is a passionate person who works dilligently to provide the best UI presentation possible. He also has great presentation skills and is quick to provide feedback and encouragement to his peers.<\/p>\n"}},{"id":93,"slug":"david-mccarty","date_provided":"10052007","job_title":"CSP,CSPO Experienced Manager and CMS Architect","title":{"rendered":"David McCarty"},"content":{"rendered":"<p>It has been a pleasure to work with David over the past few years. He consistently demonstrates a high level of technical competence balanced with attention to business needs and goals. He also takes a great deal of concern with his approach to architecting solutions that are not only creative but flexible with an eye towards a future proof solution.<\/p>\n"}},{"id":92,"slug":"kim-patrick-gerra","date_provided":"10052007","job_title":"Executive Director Of Technology at USA Cycling","title":{"rendered":"Kim Patrick Gerra"},"content":{"rendered":"<p>Dave produces beautiful work, has a great understanding of his customer&#8217;s business, and is innovative not only in design, but in all aspects of the customer&#8217;s web experience. He has an easygoing personality but will speak with conviction and passion on matters important to him. He is a pleasure to work with and I gladly endorse his work.<\/p>\n"}},{"id":91,"slug":"lori-courtney","date_provided":"10052007","job_title":"Director International Product Marketing at Sabre\/Travelocity","title":{"rendered":"Lori Courtney"},"content":{"rendered":"<p>Dave is a visionary designer. He&#8217;s wonderful to work with and always has creative solutions. Dave is an asset to our organization.<\/p>\n"}},{"id":90,"slug":"lesa-snider","date_provided":"10052007","job_title":"Software technical writer and trainer at TAIT Towers, author of 13+ books and 40+ online courses for creative pros.","title":{"rendered":"Lesa Snider"},"content":{"rendered":"<p>Dave is one of the most gifted web developers I know. We went to college together at the Art Institute of Dallas and I&#8217;ve watched his abilities blossom ever since. He&#8217;s a brilliant Flash designer and well-versed in interface design, focusing on usability. Dave would be an important asset to any team.<\/p>\n"}},{"id":89,"slug":"andy-brooks","date_provided":"10052007","job_title":"Independent Financial Planner","title":{"rendered":"Andy Brooks"},"content":{"rendered":"<p>During my tenure at the Art Institute it was not uncommon for there to be one or two students every year who “got it”, so to speak. Dave Gillem was one of those students who understood from the get go what he had to do to achieve success in school. Those personality traits not only served Dave well in school but continue to serve him in his personal and professional life.<\/p>\n<p>I met Dave Gillem as a student many years ago. I am honored to call him an industry colleague today. I have in the past sought his opinion on a variety issues related to Interactive Media. I value his council and enjoy his friendship.<\/p>\n"}},{"id":88,"slug":"dan-couto","date_provided":"10052007","job_title":"Owner, Dan Couto Photography","title":{"rendered":"Dan Couto"},"content":{"rendered":"<p>Dave is one of those rare people who&#8217;s technical expertise is equalled and often surpassed by the creative solutions he comes up with specific to your job. He&#8217;s great fun to work with and has a way of explaining why he would choose one solution over another that highlights something technical and critical in a way that does not make you feel stupid. And you remember that what he does is highly technical, he just makes it look so easy. I&#8217;d work together with Dave again in a heartbeat.<\/p>\n"}},{"id":87,"slug":"shunan-xu","date_provided":"10042007","job_title":"Trader at China Securities","title":{"rendered":"Shunan Xu"},"content":{"rendered":"<p>Dave Gillem was my advisor in 2007&#8217;s case competition for Sabre Holdings summer intern group. Dave was an amazing advisor, because he did not only have fantastic ideas, but also guided our team to go ahead on the correct and creative path. Because of his and Troy&#8217;s guidance, our team got the second place price in the case competition. It is my great pleasure to work with Dave!<\/p>\n"}},{"id":86,"slug":"dale-lockwood","date_provided":"10042007","job_title":"Managing Partner - i3 Advisory Services, LLC","title":{"rendered":"Dale Lockwood"},"content":{"rendered":"<p>We placed a huge reliance on Dave&#8217;s ability to conceptualize and create a look and feel that was consistent with our organization&#8217;s culture. He nailed it on the very first try &#8211; capturing the spirit and mood we had hoped to convey. It takes a very special talent to connect with a client at the level Dave has been able to.<\/p>\n"}},{"id":85,"slug":"vinay-moharil","date_provided":"10042007","job_title":"Director of Engineering, Experience Development at Walt Disney Parks & Resorts Technology","title":{"rendered":"Vinay Moharil"},"content":{"rendered":"<p>David is the smartest UI designer, UI creator and UI expert I have ever worked with. Very strong in UI technologies including Flash, Flex, Javascript, HTML, CSS among other things. Also really impressed with his dedication and passion and drive to get things done &#8211; but not just getting things done but getting things done the right way. <\/p>\n<p>David is also easy to work with and have seen him in action mentoring and training junior team members. He will often go beyond the call of duty to help other teams and my teams benefited from his on-demand help on more than one occasion.<\/p>\n<p>I would strongly recommend David for any UI focused group as a senior lead, mentor or a lead architect.<\/p>\n"}},{"id":78,"slug":"jimmy-harrell","date_provided":"07212007","job_title":"Account\/Project Manager at Mary Kay Inc.","title":{"rendered":"Jimmy Harrell"},"content":{"rendered":"<p>Dave has incredible talent and is focused not only on the project at hand but is seen as a visionary and teacher of many skill sets. Always willing to go above and beyond in his creative and cutting edge prototypes. He&#8217;s a gem of a find for any corporate entity.<\/p>\n"}}]